FILES/InformationRegisters/ИсторияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.СвязьНоменклатур</v8:Type>
						<v8:Type>cfg:DocumentRef.Смета</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектБТ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементСвязаннойНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.КомиссииПоставщиков</v8:Type>
						<v8:Type>cfg:DocumentRef.СписокДопУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Места</v8:Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:CatalogRef.РолиПользователейОБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ИсторияОбъектов/Ext/ManagerModule.bsl
Процедура ВставитьСообщение(Объект, Сообщение, ТипОписания = 0, ДанныеСобытия = Неопределено) Экспорт
	
	МЗ = РегистрыСведений.ИсторияОбъектов.СоздатьМенеджерЗаписи();
	МЗ.ДатаВремя = ТекущаяДата();
	МЗ.Объект = Объект.Ссылка;
	МЗ.ОписаниеСобытия = Сообщение;
	МЗ.ТипОписания = ТипОписания; 
	МЗ.ДанныеСобытия = ДанныеСобытия;
	МЗ.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Записать();
	     
КонецПроцедуры
